In [1]:
import pandas as pd

In [4]:
# Import the data

# Show the first 5 rows

       STATION                 DATE REPORT_TYPE  HourlyDryBulbTemperature
0  72295023174  2019-01-01T00:49:00       FM-16                        52
1  72295023174  2019-01-01T00:53:00       FM-15                        51
2  72295023174  2019-01-01T01:53:00       FM-15                        52
3  72295023174  2019-01-01T02:53:00       FM-15                        49
4  72295023174  2019-01-01T03:53:00       FM-15                        43

In [9]:
# Rename the columns

          station                 date report_type  hourly_temp
0     72295023174  2019-01-01T00:49:00       FM-16           52
1     72295023174  2019-01-01T00:53:00       FM-15           51
2     72295023174  2019-01-01T01:53:00       FM-15           52
3     72295023174  2019-01-01T02:53:00       FM-15           49
4     72295023174  2019-01-01T03:53:00       FM-15           43
...           ...                  ...         ...          ...
3524  72295023174  2019-04-18T21:53:00       FM-15           60
3525  72295023174  2019-04-18T22:06:00       FM-16           59
3526  72295023174  2019-04-18T22:12:00       FM-16           58
3527  72295023174  2019-04-18T22:36:00       FM-16           58
3528  72295023174  2019-04-18T22:53:00       FM-15           58

[3529 rows x 4 columns]

In [11]:
# How many reports are there of report type FM-16?

510

In [12]:
# How many readings measured a temp over 70?

96

In [13]:
# What was the temperature for the 276th reading?

61

In [15]:
# What were the dates and report types of rows 500 through 505?

                    date report_type
500  2019-01-15T16:53:00       FM-15
501  2019-01-15T17:18:00       FM-16
502  2019-01-15T17:40:00       FM-16
503  2019-01-15T17:53:00       FM-15
504  2019-01-15T18:37:00       FM-16
505  2019-01-15T18:51:00       FM-16

In [16]:
# Show the last 10 rows of the DataFrame

          station                 date report_type  hourly_temp
3519  72295023174  2019-04-18T17:53:00       FM-15           63
3520  72295023174  2019-04-18T18:53:00       FM-15           61
3521  72295023174  2019-04-18T19:53:00       FM-15           60
3522  72295023174  2019-04-18T20:53:00       FM-15           60
3523  72295023174  2019-04-18T21:48:00       FM-16           61
3524  72295023174  2019-04-18T21:53:00       FM-15           60
3525  72295023174  2019-04-18T22:06:00       FM-16           59
3526  72295023174  2019-04-18T22:12:00       FM-16           58
3527  72295023174  2019-04-18T22:36:00       FM-16           58
3528  72295023174  2019-04-18T22:53:00       FM-15           58